{
    "Title": "Sales Engineer (Diploma) Fresher Job",
    "Job Title": "Sales Engineer (Diploma)",
    "Company Name": "Jakson Group",
    "Location": "Dehradun",
    "Salary": "₹ 2,00,000 - 2,40,000",
    "Experience": "0 year(s)",
    "Skills": "Effective Communication, Hindi Proficiency (Spoken), Sales",
    "Other Requirements": "1. Fluency in spoken Hindi is required, 2. Graduated in Diploma (Mechanical, Electrical), 3. Strong communication skills and a passion for sales, 4. Enthusiasm for learning and developing a career in the sales field",
    "Responsibilities": "Key responsibilities: \n\n1. Develop and maintain relationships with customers\n2. Promote and sell products and services offered by Jakson Group Dealers\n3. Understand customer needs and provide appropriate solutions\n4. Work with a dynamic team to achieve sales targets\n5. Provide after-sales support and service to customers\n\nSelection Process:\n\n1. Application Review: Your profile will be evaluated after applying on Internshala\n2. Shortlisting: Based on the evaluation of your profile, the first round will be a telephonic interview\n3. Final Interview: An in-person interview with dealership and Jakson managers to assess your technical skills and overall suitability for the role\n\nNote: \n\n1. Travel allowance will be provided for fuel expenses\n2. 6 days working (Sunday off)",
    "Start Date": "Starts Immediately",
    "End Date": "20 Apr' 25",
    "Who can apply": "Only those candidates can apply who:, 1. are from Dehradun, Kashipur, Rudrapur, Udham Singh Nagar, Haldwani, Nainital only",
    "Posted Time": null,
    "Salary Details": "Annual CTC: ₹ 2,00,000 - 2,40,000 /year",
    "Perks": null,
    "Number of Openings": "10",
    "About Company": "For over 75 years, we've been at the forefront of revolutionizing the energy sector with our innovative distributed energy solutions. As market leaders, we continuously strive to provide 24/7 power backup to all, leveraging our expertise in diesel generators, distributed generation, and silent gensets. Our commitment to excellence extends to offering customized, sustainable solutions for businesses and homes, including solar rooftop systems and battery energy storage. With a comprehensive portfolio encompassing diesel generators, solar rooftop installations, microgrids, battery energy storage systems, and specialized defense gensets, we stand as the epitome of reliability and innovation in the energy sector. At Jakson, we are committed to empowering India with nothing but the best in distributed energy resources.",
    "Hiring Since": "Hiring since February 2025",
    "Opportunities Posted": null,
    "Candidates Hired": "3 candidates hired"
}